import React, { Component } from 'react';
import style from './css/registerProtocol.module.scss';
class RegisterProtocol extends Component {
    constructor(props) {
        super(props);
        this.state = {}
    }
    render() {
        return (
            <div className={style.container}>
                <p>企融管家在此郑重提示您，本协议是您（用户，包括自然人、法人）与“企融管家APP”注册及服务相关事宜所订立的法律协议，适用于您在企融管家注册及使用企融管家服务的全部行为。</p>
                <p>请您认真阅读并理解本协议。您通过企融管家点击确认本协议的，即表示您同意遵循本协议的所有约定，本协议在您和企融管家之间具有法律约束力。如发生法律纠纷，您不得以未仔细阅读或理解本协议为由进行抗辩。企融管家可能根据法律法规的要求或业务运营的需要，对本注册协议不时进行修改。除非另有规定，否则任何变更或修改将在修订内容于企融管家发布之时立即生效，用户对企融管家的使用、继续使用将表明用户接受此等变更或修改。若您不同意或者不接受本协议的全部或部分内容，请您不要注册成为企融管家用户及使用企融管家服务。</p>
                <h3>第一条 用户确认及服务接纳</h3>
                <p>1.1 注册用户需满足下列条件： </p>
                <p>（1）中华人民共和国大陆地区内居民（不包含台、港、澳地区）；</p>
                <p>（2）具备接受企融管家各项服务，履行相应义务的完全民事权利能力及行为能力。</p>
                <p>1.2 用户需接受企融管家全部协议条款及各项企融管家规则，方可成为企融管家注册用户，接受企融管家提供的各项服务。</p>
                <p>1.3 用户确认本协议全部条款并完成注册的，视为用户符合注册条件，能够独立承担因接受企融管家服务所产生权利义务。</p>
                <p>1.4 企融管家保留在中华人民共和国现行有效之法律、法规范围内接受、拒绝、终止/中止用户接受企融管家服务之资格。</p>
                <h3>第二条 用户注册信息</h3>
                <p>2.1 用户首次通过企融管家提交个人信息并确认本协议的，即成为企融管家注册用户。</p>
                <p>2.2 用户应自行如实向企融管家提供注册信息。用户应当确保其提供的注册信息真实、准确、完整、合法有效。如用户提供的注册信息不合法、不真实、不准确、不详尽，用户需承担由此产生的相应责任及后果，企融管家保留终止注册用户资格的权利。</p>
                <p>2.3 用户已明确授权，为了企融管家能够更加效率及便利地为用户提供企融管家服务，且不将用户资料及信息用于其他目的前提条件下。允许企融管家对用户本人提交的资料及信息以及企融管家自行收集的用户资料及信息等其他方式渠道收集的资料及信息进行访问、收集、储存、整理加工、使用和披露用户的资料及信息。具体方式包含但不限于：</p>
                <p>（1）出于为用户提供服务的需要在本网站公示用户的个人资料；</p>
                <p>（2）由人工或自动程序对用户的个人资料进行获取、评估、整理、存储；</p>
                <p>（3）使用用户的个人资料以改进本网站的设计和推广；</p>
                <p>（4）使用用户提供的联系方式与用户联络，并向用户传递有关服务和管理方面的信息；</p>
                <p>（5）对用户的个人资料进行分析整合并向为用户提供服务的第三方提供为完成该项服务必要的信息。当为用户提供服务的第三方与用户电话核实信息时，为保证为用户服务的质量，用户同意企融管家对上述核实电话进行录音。</p>
                <p>（6）在用户违反与企融管家或企融管家的其他用户签订的协议时，披露用户的个人资料及违约事实，将用户的违约信息写入黑名单并与必要的第三方共享数据，以供企融管家及第三方审核、追索之用。</p>
                <p>（7）其他必要的使用及披露用户个人资料的情形。用户已明确同意本条款不因用户终止使用企融管家服务而失效。如因企融管家行使本条款项下权利使用户遭受损失，企融管家对该等损失免责。</p>
                <p>（8）使用用户的个人资料进行申请贷款时，收集用户的个人资料与三方合作机构没有关系（银行、小贷机构等），由平台独立承担数据保密和使用的权利。当使走完申请贷款全流程之后，平台将不再使用此条数据。</p>
                <p>（9）为更好地为用户提供服务，用户同意并授权企融管家可与其合作的第三方进行联合研究，并可将通过本协议获得的用户的信息投入到该等联合研究中。但企融管家与其合作的第三方在开展上述联合研究前，应要求其合作的第三方对在联合研究中所获取的用户的信息予以保密。</p>
                <p>2.4 企融管家应当采取不低于一般行业惯例对于用户的资料及信息进行保护，但因不可抗力所导致的用户资料及信息泄露（包含但不限于黑客攻击、第三方导致的系统缺陷等），企融管家不承担相应的责任。</p>
                <p>2.5 企融管家不会向与用户无关的第三方恶意出售或免费提供用户的个人资料，以下情况除外：</p>
                <p>（1）事先获得用户的明确授权；</p>
                <p>（2）按照行政、司法机关的要求向该等机关提供用户的资料及信息；</p>
                <p>（3）以维护企融管家合法权益之目的；</p>
                <p>（4）维护社会公众利益；</p>
                <p>（5）为了确保企融管家业务和系统的完整与操作。</p>
                <p>（6）符合其他合法要求。</p>
                <p> 2.6 用户应当谨慎地保存、使用其企融管家账号、密码、手机验证码等信息。用户不得将企融管家账号向他人透露、借用，否则用户应当承担由此产生的全部后果及责任。</p>
                <h3>第三条 企融管家服务</h3>
                <p>3.1 服务的内容</p>
                <p>企融管家依法向企融管家注册用户提供互联网信息服务等服务内容。</p>
                <p>具体如下：</p>
                <p>（1）企融管家依法向企融管家注册用户提供浦发信用卡、中信信用卡、兴业信用卡等信用卡的便捷申请渠道服务。</p>
                <p>（2）企融管家依法向企融管家注册用户提供玖富万卡、小赢卡贷、友信等企业贷和个人贷贷款产品的便捷申请渠道服务。</p>
                <p>（3）企融管家依法向企融管家注册用户提供其他金融资讯方面的服务。</p>
                <p>（4）企融管家依法向企融管家注册用户提供个人信用查询方面的服务。</p>
                <p>（5）企融管家依法向企融管家注册用户提供法律法规所允许的其他方面的服务。</p>
                <p>3.2 服务的获取</p>
                <p>您可以直接从企融管家相关的网站上获取本服务，也可以从得到企融管家授权的第三方获取。如果您从未经企融管家授权的第三方获取具备企融管家服务的软件或与名称相同的安装程序，企融管家无法保证该软件能够正常使用，并对因此给您造成的损失不予负责。</p>
                <p> 3.3 服务的更新</p>
                <p>（1）为了改善用户体验、完善服务内容，企融管家将不断努力开发新的服务，并为你不时提供相关软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</p>
                <p>（2）为了保证本服务的安全性和功能的一致性，企融管家有权不经向您特别通知而对相关软件进行更新，或者对相关软件的部分功能效果进行改变或限制。</p>
                <p>（3）企融管家新版本服务发布后，旧版本的相关软件可能无法使用。企融管家不保证旧版本的相关软件继续可用及提供相应的服务，请您随时核对并下载最新版本。</p>
                <h3>第四条 用户承诺</h3>
                <p>4.1 用户应当妥善保管本人的企融管家账号、密码、绑定的手机号码、手机验证码等信息。对于非因企融管家过错产生的上述信息泄露所导致的用户损失企融管家不承担任何责任。</p>
                <p>4.2 用户承诺在接受企融管家服务过程中应当诚实、守信地履行相关义务，否则将承担包含但不限于下列后果：</p>
                <p>（1）用户的不良信用信息将被上传至经中国人民银行批准并依法设立的各征信数据机构；</p>
                <p>（2）用户将因违约行为承担相应的违约责任；</p>
                <p>（3）用户将因违约行为承担相应的诉讼后果。</p>
                <p>4.3 用户享有言论自由的权利。 但用户的言行不得违反《计算机信息网络国际联网安全保护管理办法》、《互联网信息服务管理办法》、《互联网电子公告服务管理规定》、《维护互联网安全的决定》、《互联网新闻信息服务管理规定》《互联网跟帖评论服务管理规定》等相关法律规定，不得在企融管家相关版块发布、传播或以其它方式传送含有下列内容之一的信息：</p>
                <p>1.反对宪法所确定的基本原则的；</p>
                <p> 2.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
                <p>3.损害国家荣誉和利益的；</p>
                <p>4.煽动民族仇恨、民族歧视、破坏民族团结的；</p>
                <p>5.破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
                <p>6.散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
                <p>7.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
                <p>8.侮辱或者诽谤他人，侵害他人合法权利的；</p>
                <p>9.煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p>
                <p>10.以非法民间组织名义活动的；</p>
                <p>11.含有虚假、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</p>
                <p>12.侵犯他人知识产权或其他合法权益的；</p>
                <p>13.含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的。</p>
                <p>14.授权人（乙方）同意被授权人（甲方）在合同约定的期限内或本授权书有效期内，因系统出现故障等原因导致用户的账户产生非正当所得收入，甲方有权委托银行或第三方支付机构从用户绑定的银行账户内以非正当所得收入扣除标准划付应付费用。</p>
                <p>15.授权人（乙方）在指定账户中必须留有足够余额，否则因账户余额不足不可归责于被授权人（甲方）的任何事由，导致无法及时扣款或扣款异常，包括但不限于错误、失败等，责任由授权人（乙方）自行承担。</p>
                <h3>第五条 征信授权</h3>
                <p>5.1 用户在此不可撤销地授权企融管家通过依法设立的征信机构了解、咨询、审查用户的个人信息、信用状况、履约能力及其他评定用户资信状况的信息，包含可能存在的用户不良信用信息。</p>
                <p>5.2 用户在此不可撤销地授权企融管家向依法设立的征信机构提供用户接受企融管家服务所对应的个人信息、借贷信息及后续还款记录等信息。</p>
                <p>5.3 用户在此不可撤销地授权企融管家向依法设立的征信机构提供用户可能产生的不良信用信息。</p>
                <h3>第六条 关于电子合同</h3>
                <p>6.1 本协议采用电子文本形式制成，并在企融管家系统上保留存档。其签订方式符合《中华人民共和国电子签名法》的要求。用户通过企融管家系统点击确认或以其他方式选择接受本协议，即表示已同意接受本协议的全部内容以及与本协议有关的各项企融管家规则。</p>
                <p>6.2 用户应当妥善保管自己的账号、密码等账户信息，不得以账户信息被盗用或其他理由否认已订立的协议的效力或不履行相关义务。</p>
                <h3>第七条 责任限制</h3>
                <p> 除非另有明确的书面说明，企融管家及其所包含的或以其它方式通过企融管家提供给用户的全部信息、内容、材料、产品（包括软件）和服务，均是在“按现状”和“按现有”的基础上提供的。</p>
                <p>如因不可抗力或其它企融管家无法控制的原因企融管家系统崩溃或无法正常使用导致无法向用户提供企融管家服务的，企融管家不承担任何责任。</p>
                <h3>第八条 联系信息更新</h3>
                <p>用户接受企融管家服务期间，用户本人姓名、身份证号码、手机号码、银行账户等信息如发生变更，应当在相关信息发生变更之日起三日内将更新后的信息提供给企融管家。因用户未能及时提供上述变更信息而带来的损失或额外费用应由用户自行承担。</p>
                <h3>第九条 适用法律及争议解决</h3>
                <p>9.1 本协议的签订、履行、终止、解释均适用中华人民共和国法律。</p>
                <p>9.2 因履行本协议所产生的争议应当通过友好协商解决；如协商不成，则本协议任意一方均可向本协议签订地安徽省合肥市蜀山区有管辖权的人民法院起诉。</p>
                <h3>第十条 其他</h3>
                <p>10.1 本协议自用户签署并注册成为企融管家用户之日起生效，除非企融管家终止本协议或者用户丧失企融管家用户资格，否则本协议始终有效。出于运行和交易安全的需要，企融管家可以暂时停止提供或者限制本服务部分功能，或提供新的功能，在任何功能减少、增加或变化时，只要用户仍使用企融管家服务，表示用户仍然同意本协议或者变更后的协议。</p>
                <p>10.2 本协议终止并不免除用户根据本协议或其他有关协议、规则、已经发生的行为或达成的交易项下所应承担的义务与责任。</p>
                <p>10.3 企融管家未行使或执行本服务协议任何权利或规定，不构成对前述权利之放弃。</p>
                <p>10.4 本协议未尽事项按照企融管家现有及不时发布的各项规则执行。</p>
                <p> 10.5 如本协议中的任何一条或多条被确认为无效，该无效条款并不影响本协议其他条款的效力。</p>
                <p>10.6 企融管家对本协议享有最终解释权。</p>
            </div>
        );
    }
}

export default RegisterProtocol;